Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/before_your_baby_is_born/antenatal_visits.html.txt.tmx
Source language: en
Languages: ga

source: Generally, you will have approximately 8-10 antenatal appointments with your doctor or midwife during your pregnancy
ga: Go ginearálta, beidh thart ar idir 8 agus 10 gcoinne réamhbhreithe agat le do dhochtúir nó le do bhean chabhrach i rith do thoirchis

source: You may visit your GP, antenatal clinic or midwife monthly until 32 weeks, fortnightly after that and you may have weekly visits in the last month
ga: Féadfaidh tú cuairt a thabhairt ar do LG, clinic réamhbhreithe nó do bhean chabhrach gach mí go dtí 32 seachtain, gach coicís ina dhiaidh sin agus féadfaidh tú cuairteanna seachtainiúla a thabhairt sa mhí dheireanach

source: You are entitled to take paid time off from your employment to attend antenatal appointments (this also includes some antenatal classes)
ga: Tá tú i dteideal am saor le híocaíocht a ghlacadh ó d’fhostaíocht chun freastal ar choinní réamhbhreithe (áirítear leis seo ranganna réamhbhreithe)

source: These employment rights are protected in Irish law through the Maternity Protection Acts 1994 and 2004, the Maternity Protection (Time Off for Ante-Natal Care and Post-Natal Care) Regulations 1995, and the Maternity Protection (Disputes and Appeals) Regulations 1995
ga: Tá na cearta fostaíochta seo á gcosaint i ndlí na hÉireann trí na hAchtanna um Chosaint Mháithreachais, 1994 agus 2004, na Rialacháin um Chosaint Mháithreachais (Am Saor le haghaidh Cúraim Réamhbhreithe agus Iarbhreithe), 1995, agus na Rialacháin um Chosaint Mháithreachais (Díospóidí agus Achomhairc), 1995

source: The first antenatal visit
ga: An chéad chuairt réamhbhreithe

source: Your first visit to hospital can be any time from 12-20 weeks in the pregnancy
ga: Is féidir le do chéad chuairt chuig an ospidéal a bheith ag aon am ó 12-20 seachtain isteach sa toircheas

source: The purpose of this visit is to get a full picture of your health and the health of your baby
ga: Is é cuspóir na cuairte sin léargas iomlán a fháil ar do shláinte agus ar shláinte do linbh

source: You can expect to speak to a midwife, who will ask a range of background questions about your health and medical history
ga: Is féidir leat a bheith ag súil le labhairt le bean chnáimhsí, a chuirfidh réimse ceisteanna cúlracha faoi do shláinte agus faoi do stair mhíochaine

source: This will also be an opportunity for you to ask questions about your care and the range of services that are available to you
ga: Beidh deis agat féin aon cheisteanna atá agat a chur maidir le do chúram agus an réimse seirbhísí atá ar fáil duit

source: You will be asked for a urine sample, will have your blood pressure taken and will have blood tests
ga: Iarrfar ort sampla fuala a thabhairt, glacfar do bhrú fola agus déanfar tástálacha fola

source: The purpose of the blood tests will be explained to you
ga: Míneófar duit cén fáth a bhfuil na tástálacha fola dhá dhéanamh

source: In some hospitals, you may have an ultrasound scan on your first visit, at others you will have it at around 20 weeks
ga: I roinnt ospidéal is féidir leat scanadh ultrafhuaime a fháil ar do chéad chuairt, ag ospidéil eile beidh an scanadh sin agat ag thart ar 20 seachtain

source: The visit lasts approximately 2 hours
ga: Maireann an chuairt thart ar 2 uair an chloig

source: If your pregnancy is normal, subsequent visits will be much shorter
ga: Más gnáth-thoircheas a bhíonn agat, beidh na cuairteanna ina dhiaidh sin i bhfad níos giorra

source: Visits can be shared between the hospital and your GP or midwife
ga: Is féidir na cuairteanna a roinnt idir an ospidéal agus do dhochtúir teaghlaigh nó bean chnáimhsí

source: At each visit you will provide a urine sample, your blood pressure will be taken and you will be examined
ga: Ag gach cuairt soláthróidh tú sampla fuala, glacfar do bhrú fola agus scrúdófar tú

source: If you have any questions or worries related to your pregnancy, you should ask the midwife or doctor
ga: Má bhíonn aon cheist agat nó aon imní ort maidir le do thoircheas ba chóir duit ceist a chur ar an mbean chnáimhsí nó ar an dochtúir

source: Most hospitals will have a system of parentcraft classes which you and your partner or friend can attend near the time of birth
ga: Tá ranganna i scileanna tuismitheoireachta ar fáil i bhformhór na n-ospidéal agus is féidir leatsa agus le do pháirtí nó cara freastal a dhéanamh orthu i ngar go ham na breithe

source: These sessions will provide you with an opportunity to learn more about breastfeeding, nutrition, maintaining a healthy lifestyle and preparing you and your family for the birth of the baby
ga: Tabharfar deis duit ag na ranganna seo foghlaim faoi chothú cíche, beathú, stíl mhaireachtála sláintiúil a choinneáil agus déanfar tú féin agus do theaghlach a ullmhú do bhreith an linbh

source: Employment and antenatal visits
ga: Fostaíocht agus cuairteanna réamhbhreithe

source: If you become pregnant while in employment you are entitled, under employment law, to take time off to attend antenatal appointments
ga: Má fhaigheann tú torrach agus tú i bhfostaíocht tá tú i dteideal, faoin dlí fostaíochta, am a thógáil saor le freastal ar choinní réamhbhreithe

source: You should apply to your employer in writing providing medical evidence of your pregnancy and telling your employer that you need time off to attend antenatal appointments
ga: Ba chóir duit iarratas a dhéanamh i scríbhinn chuig d'fhostóir agus fianaise mhíochaine de do thoircheas á sholáthar agat ag insint dó/dí go dteastaíonn am saor uait le freastal ar choinní réamhbhreithe

source: You should give at least 2 weeks' written notice of the date and time of your appointments
ga: Ba chóir duit ar a laghad fógra coicíse a thabhairt de dháta agus d'am do choinní

source: If this notice is not given for reasons not in your control, then you can retain your entitlement, provided you write to your employer with an explanation and with the notice
ga: Mura dtugtar fógra de bharr cúiseanna nach bhfuil aon neart agat orthu, ansin is féidir leat do theideal a choinneáil, más rud é go scríobhann tú chuig d'fhostóir agus míniú a thabhairt agat i dteannta leis an bhfógra

source: You will need to do this within one week of the appointment
ga: Beidh ort é sin a dhéanamh laistigh de sheachtain den choinne

source: For any visit after the first appointment your employer may ask to see your appointment card
ga: D'aon chuairt tar éis na céad cuairte is féidir le d'fhostóir iarraidh ort do chárta coinní a thaispeáint dó/di

source: You are entitled to medical visits after the birth of your baby for 14 weeks following the birth, including any period taken on maternity leave following the birth
ga: Tá tú i dteideal cuairteanna míochaine ar feadh 14 seachtaine tar éis na breithe, lena n-áirítear aon tréimhse a thógtar ar saoire mháithreachais tar éis na breithe

source: You may be entitled to take paid time off from work to attend some antenatal classes
ga: D’fhéadfadh sé go mbeadh tú i dteideal roinnt ama a thógáil saor ón obair le híocaíocht le freastal ar roinnt ranganna réamhbhreithe

source: For expectant fathers, this is a once-off right to attend the 2 classes immediately prior to the birth
ga: Is ceart aon uair atá anseo do fhir a bhfuil páistí leo le teacht ar an saol freastal ar an 2 rang díreach roimh an mbreith

source: For expectant mothers, the entitlement is to attend only one set of classes (except the last 3 in a set) over all her pregnancies while in employment
ga: Do mhná atá ag súil tá sé de cheart acu freastal ar sraith amháin ranganna (gan an 3 rang deireanach sa sraith a bheith san áireamh) dá cuid toircheas ar fad agus iad fostaithe
